TD_liste.org
#+TITLE: Liste

* EXO 1 

** La cellule

*** Implémentation 

    Une cellule sera implémentée de cette façon :
    - Une variable de type T qui sera notre valeur à stocker.
    - Une cellule qui représente l'index de notre cellule suivante.

*** Les méthodes de la cellule

**** créerCellule O(1)
     
     #+BEGIN_SRC c
       Cellule creerCellule()
       {
         Cellule c = new Cellule();
         c.val = null;
         c.suiv = null;
         return c;
       }  
     #+END_SRC
**** valeurCellule O(1)

     #+BEGIN_SRC c
       T valeurCellule(Cellule c)
       {
         return c.val;
       }
     #+END_SRC
**** suivantCellule O(1)

     #+BEGIN_SRC c
       Cellule suivantCellule(Cellule c)
       {
         return c.suiv;
       }
     #+END_SRC
     
**** insererSuivantCellule O(1)

     #+BEGIN_SRC c
       Cellule insererSuivantCellule(Cellule c, Cellule s)
       {
         c.suiv = s;
         return s;
       }
     #+END_SRC
     
**** dernierCellule O(1)

     #+BEGIN_SRC c
       Cellule dernierCellule(Cellule c)
       {
         return suivantCellule(c) == null;
       }
     #+END_SRC
     

** QUESTION 1  

*** Implémentation 
    La liste sera implémentée de cette façon :
    - Un tableau pour stocker nos cellules.
    - Une pile pour connaître les cellules encore vides.
    - un entier qui nous indiquera l'index de notre première cellule.

*** Les méthodes de la liste

**** créerListe O(1)

     #+BEGIN_SRC c
       Liste creerListe(int n)
       {
         Liste l = new Liste();
         l.tab = Cellule[n];
         l.pile = creerPile(n);
         for (int i = 0; i < n; ++i)
           {
             empile(l.pile,tab[i]);
           }
         l.start = null;
         return l;
       }
     #+END_SRC
     
**** estVideListe O(1)

     #+BEGIN_SRC c
       bool estVideListe(Liste l)
       {
         return l.start = null;
       }  
     #+END_SRC

**** teteList O(1) 

     #+BEGIN_SRC c
       Cellule teteListe(Liste l)
       {
         return l.start;
       }  
     #+END_SRC
**** insererTeteList O(1)
     
     #+BEGIN_SRC c
       Liste insererTeteListe(Liste l,T val)
       {
         if(!estVide(l.pile))
           {
             Cellule nouveauStart = sommet(l.pile);
             nouveauStart.val = val;
             insererSuivantCellule(nouveauStart,l.start);
             l.start = nouveauStart;
             depiler(l.pile);
           }
         return l;
       }
     #+END_SRC
**** supprimerTeteListe O(1)

     #+BEGIN_SRC c 
       Liste supprimerTeteListe(Liste l)
       {
         if(!estPlein(l.pile))
           {
             empiler(l.pile,l.start);
             l.start = suivantCellule(l.start);
           }
         return l;
       }
     #+END_SRC
**** tailleListe O(n)

     #+BEGIN_SRC c
       int tailleListe(Liste l)
       {
         int size = 0;
         Cellule celluleActuelle = teteListe(l);
         while (celluleActuelle != null)
           {
             size++;
           }

         return size;
       }  
     #+END_SRC

