TD_liste.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-20 sam. 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Liste</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="cliquot" />
</head>
<body>
<div id="content">
<h1 class="title">Liste</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge93909b">1. EXO 1</a>
<ul>
<li><a href="#org48c6fcf">1.1. La cellule</a>
<ul>
<li><a href="#orgf81a046">1.1.1. Implémentation</a></li>
<li><a href="#org4fc205a">1.1.2. Les méthodes de la cellule</a></li>
</ul>
</li>
<li><a href="#org344f4f8">1.2. QUESTION 1</a>
<ul>
<li><a href="#org4d21989">1.2.1. Implémentation</a></li>
<li><a href="#orgf2b7b69">1.2.2. Les méthodes de la liste</a></li>
</ul>
</li>
<li><a href="#org00d7b98">1.3. QUESTION 2</a>
<ul>
<li><a href="#org83bef63">1.3.1. Implémentation</a></li>
<li><a href="#org52aef1c">1.3.2. Les méthodes de la liste (même complexité en temps que la QUESTION 1)</a></li>
</ul>
</li>
<li><a href="#org10907cb">1.4. QUESTION 3</a></li>
</ul>
</li>
<li><a href="#org9f3dc25">2. Exo 2</a></li>
<li><a href="#org4b94ffc">3. Exo 3</a>
<ul>
<li><a href="#org2c2dfe1">3.1. QUESTION 1</a></li>
<li><a href="#org1895cfa">3.2. QUESTION 2</a></li>
<li><a href="#orga8880fe">3.3. QUESTION 3</a>
<ul>
<li><a href="#org6ebc9ad">3.3.1. PILE (est donc composée d'une liste l);</a></li>
<li><a href="#org83cde9b">3.3.2. FILE (est donc composée d'une liste l);</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc1c3f0d">4. Exo 4</a>
<ul>
<li>
<ul>
<li><a href="#orgc43b9ea">4.0.1. Fonction</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge93909b" class="outline-2">
<h2 id="orge93909b"><span class="section-number-2">1</span> EXO 1</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org48c6fcf" class="outline-3">
<h3 id="org48c6fcf"><span class="section-number-3">1.1</span> La cellule</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgf81a046" class="outline-4">
<h4 id="orgf81a046"><span class="section-number-4">1.1.1</span> Implémentation</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Une cellule sera implémentée de cette façon :
</p>
<ul class="org-ul">
<li>Une variable de type T qui sera notre valeur à stocker.</li>
<li>Une cellule qui représente l'index de notre cellule suivante.</li>
</ul>
</div>
</div>

<div id="outline-container-org4fc205a" class="outline-4">
<h4 id="org4fc205a"><span class="section-number-4">1.1.2</span> Les méthodes de la cellule</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="org0e10b98"></a>créerCellule O(1)<br />
<div class="outline-text-5" id="text-1-1-2-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #93E0E3;">creerCellule</span><span style="color: #DCDCCC;">()</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">c</span> = new Cellule<span style="color: #BFEBBF;">()</span>;
  c.val = null;
  c.suiv = null;
  <span style="color: #F0DFAF; font-weight: bold;">return</span> c;
<span style="color: #DCDCCC;">}</span>  
</pre>
</div>
</div>
</li>
<li><a id="org36e7e0a"></a>valeurCellule O(1)<br />
<div class="outline-text-5" id="text-1-1-2-2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">T</span> <span style="color: #93E0E3;">valeurCellule</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">c</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> c.val;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="org227a9c0"></a>suivantCellule O(1)<br />
<div class="outline-text-5" id="text-1-1-2-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #93E0E3;">suivantCellule</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">c</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> c.suiv;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>

<li><a id="org236a0dd"></a>insererSuivantCellule O(1)<br />
<div class="outline-text-5" id="text-1-1-2-4">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #93E0E3;">insererSuivantCellule</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">c</span>, <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">s</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  c.suiv = s;
  <span style="color: #F0DFAF; font-weight: bold;">return</span> s;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>

<li><a id="org5ea965b"></a>dernierCellule O(1)<br />
<div class="outline-text-5" id="text-1-1-2-5">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #93E0E3;">dernierCellule</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">c</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> suivantCellule<span style="color: #BFEBBF;">(</span>c<span style="color: #BFEBBF;">)</span> == null;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-org344f4f8" class="outline-3">
<h3 id="org344f4f8"><span class="section-number-3">1.2</span> QUESTION 1</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org4d21989" class="outline-4">
<h4 id="org4d21989"><span class="section-number-4">1.2.1</span> Implémentation</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
La liste sera implémentée de cette façon :
</p>
<ul class="org-ul">
<li>Un tableau pour stocker nos cellules.</li>
<li>Une pile pour connaître les cellules encore vides.</li>
<li>un entier qui nous indiquera l'index de notre première cellule.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf2b7b69" class="outline-4">
<h4 id="orgf2b7b69"><span class="section-number-4">1.2.2</span> Les méthodes de la liste</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<ol class="org-ol">
<li><a id="orge013282"></a>créerListe O(1)<br />
<div class="outline-text-5" id="text-1-2-2-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #93E0E3;">creerListe</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">n</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span> = new Liste<span style="color: #BFEBBF;">()</span>;
  l.tab = Cellule<span style="color: #BFEBBF;">[</span>n<span style="color: #BFEBBF;">]</span>;
  l.pile = creerPile<span style="color: #BFEBBF;">(</span>n<span style="color: #BFEBBF;">)</span>;
  <span style="color: #F0DFAF; font-weight: bold;">for</span> <span style="color: #BFEBBF;">(</span><span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">i</span> = 0; i &lt; n; ++i<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      empile<span style="color: #D0BF8F;">(</span>l.pile,tab<span style="color: #93E0E3;">[</span>i<span style="color: #93E0E3;">]</span><span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  l.start = null;
  <span style="color: #F0DFAF; font-weight: bold;">return</span> l;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>

<li><a id="org3db13cd"></a>estVideListe O(1)<br />
<div class="outline-text-5" id="text-1-2-2-2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">bool</span> <span style="color: #93E0E3;">estVideListe</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> l.start = null;
<span style="color: #DCDCCC;">}</span>  
</pre>
</div>
</div>
</li>

<li><a id="org3caad7f"></a>teteList O(1)<br />
<div class="outline-text-5" id="text-1-2-2-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #93E0E3;">teteListe</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> l.start;
<span style="color: #DCDCCC;">}</span>  
</pre>
</div>
</div>
</li>
<li><a id="orgfb455a1"></a>insererTeteList O(1)<br />
<div class="outline-text-5" id="text-1-2-2-4">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #93E0E3;">insererTeteListe</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span>,<span style="color: #7CB8BB; font-weight: bold;">T</span> <span style="color: #DFAF8F;">val</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">!</span>estVide<span style="color: #D0BF8F;">(</span>l.pile<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">nouveauStart</span> = sommet<span style="color: #D0BF8F;">(</span>l.pile<span style="color: #D0BF8F;">)</span>;
      nouveauStart.val = val;
      insererSuivantCellule<span style="color: #D0BF8F;">(</span>nouveauStart,l.start<span style="color: #D0BF8F;">)</span>;
      l.start = nouveauStart;
      depiler<span style="color: #D0BF8F;">(</span>l.pile<span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> l;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="org73a3b69"></a>supprimerTeteListe O(1)<br />
<div class="outline-text-5" id="text-1-2-2-5">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #93E0E3;">supprimerTeteListe</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">!</span>estPlein<span style="color: #D0BF8F;">(</span>l.pile<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      empiler<span style="color: #D0BF8F;">(</span>l.pile,l.start<span style="color: #D0BF8F;">)</span>;
      l.start = suivantCellule<span style="color: #D0BF8F;">(</span>l.start<span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> l;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
