TD_liste.org
**** queue O(1)  

     #+BEGIN_SRC c
              Liste queue(Liste l)
              {
                Liste retour = creerListe(n-1);
                retour.start = suivantCellule(teteListe(l));
                return retour;
              }
     #+END_SRC
**** obtenirElement O(i)
     #+BEGIN_SRC c
       Cellule obtenirElement(Liste l,int i)
       {
         Cellule celluleActuelle = teteListe(l);
         while(celluleAtuelle != null && i > 0)
           {
             i--;
             celluleActuelle = suivantCellule(celluleActuelle);
           }
         return valeurCellule(celluleActuelle);

       }
     #+END_SRC
**** insererElement O(i)

     #+BEGIN_SRC c
       Liste insererElement(Liste l,T val,int index)
       {
         if(index == 0)
           {
             insererTeteListe(l,val);
           }
         else {
           if(!estVide(l.pile))
             {
               Cellule celluleActuelle = teteListe(l);
               while (dernierCellule(celluleActuelle) && index > 1) {
                 index--;
                 celluleActuelle = suivantCellule(celluleActuelle);
               }
               Cellule celluleSuivante = suivantCellule(celluleActuelle);
               insererSuivantCellule(celluleActuelle,sommet(l.pile));
               depiler(l.pile);
               suivantCellule(celluleActuelle).val = val;
               insererSuivantCellule(suivantCellule(celluleActuelle),celluleSuivante);
             }
         }
         return l;
       }
     #+END_SRC
**** supprimerElement O(i)

     #+BEGIN_SRC c
       Liste supprimerElement(Liste l,int index)
       {
         if(index == 0)
           {
             return supprimerTeteListe(l);
           }
         else {
           Cellule celluleActuelle = teteListe(l);
           while(dernierCellule(celluleActuelle) != null && i > 1)
             {
               i--;
               celluleActuelle = suivantCellule(celluleActuelle);
             }
           if (index == 1 && !estPlein(l.pile)) {
             Cellule celluleASupprimer = suivantCellule(celluleActuelle);
             insererSuivantCellule(celluleActuelle,suivantCellule(celluleASupprimer));
             empiler(celluleASupprimer);
           }
           return l;
         }
       }
     #+END_SRC



** QUESTION 2
   
*** Implémentation 
    La liste sera implémentée de cette façon :
    - Une seule cellule qui représentera la tête de notre tableau.

*** Les méthodes de la liste (même complexité en temps que la QUESTION 1) 

**** créerListe()

     #+BEGIN_SRC c
       Liste creerListe()
       {
         Liste l = new Liste();
         l.tete = null;
         return l;
       }
     #+END_SRC
     
**** estVideListe

     #+BEGIN_SRC c
       bool estVideListe(Liste l)
       {
         return teteListe(l) == null;
       }  
     #+END_SRC

**** teteListe

     #+BEGIN_SRC c
       Cellule teteListe(Liste l)
       {
         return l.tete;
       }  
     #+END_SRC
