TD_liste.html
<li><a id="orgffca9b4"></a>tailleListe O(n)<br />
<div class="outline-text-5" id="text-1-2-2-6">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #93E0E3;">tailleListe</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">size</span> = 0;
  <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">celluleActuelle</span> = teteListe<span style="color: #BFEBBF;">(</span>l<span style="color: #BFEBBF;">)</span>;
  <span style="color: #F0DFAF; font-weight: bold;">while</span> <span style="color: #BFEBBF;">(</span>celluleActuelle != null<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      size++;
    <span style="color: #BFEBBF;">}</span>

  <span style="color: #F0DFAF; font-weight: bold;">return</span> size;
<span style="color: #DCDCCC;">}</span>  
</pre>
</div>
</div>
</li>

<li><a id="org3dbc037"></a>queue O(1)<br />
<div class="outline-text-5" id="text-1-2-2-7">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #93E0E3;">queue</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">retour</span> = creerListe<span style="color: #BFEBBF;">(</span>n-1<span style="color: #BFEBBF;">)</span>;
  retour.start = suivantCellule<span style="color: #BFEBBF;">(</span>teteListe<span style="color: #D0BF8F;">(</span>l<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>;
  <span style="color: #F0DFAF; font-weight: bold;">return</span> retour;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="org2dcd36f"></a>obtenirElement O(i)<br />
<div class="outline-text-5" id="text-1-2-2-8">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #93E0E3;">obtenirElement</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span>,<span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">i</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">celluleActuelle</span> = teteListe<span style="color: #BFEBBF;">(</span>l<span style="color: #BFEBBF;">)</span>;
  <span style="color: #F0DFAF; font-weight: bold;">while</span><span style="color: #BFEBBF;">(</span>celluleAtuelle != null &amp;&amp; i &gt; 0<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      i--;
      celluleActuelle = suivantCellule<span style="color: #D0BF8F;">(</span>celluleActuelle<span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> valeurCellule<span style="color: #BFEBBF;">(</span>celluleActuelle<span style="color: #BFEBBF;">)</span>;

<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="org8710322"></a>insererElement O(i)<br />
<div class="outline-text-5" id="text-1-2-2-9">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #93E0E3;">insererElement</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span>,<span style="color: #7CB8BB; font-weight: bold;">T</span> <span style="color: #DFAF8F;">val</span>,<span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">index</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span>index == 0<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      insererTeteListe<span style="color: #D0BF8F;">(</span>l,val<span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">else</span> <span style="color: #BFEBBF;">{</span>
    <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">!</span>estVide<span style="color: #93E0E3;">(</span>l.pile<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">{</span>
        <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">celluleActuelle</span> = teteListe<span style="color: #93E0E3;">(</span>l<span style="color: #93E0E3;">)</span>;
        <span style="color: #F0DFAF; font-weight: bold;">while</span> <span style="color: #93E0E3;">(</span>dernierCellule<span style="color: #9FC59F;">(</span>celluleActuelle<span style="color: #9FC59F;">)</span> &amp;&amp; index &gt; 1<span style="color: #93E0E3;">)</span> <span style="color: #93E0E3;">{</span>
          index--;
          celluleActuelle = suivantCellule<span style="color: #9FC59F;">(</span>celluleActuelle<span style="color: #9FC59F;">)</span>;
        <span style="color: #93E0E3;">}</span>
        <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">celluleSuivante</span> = suivantCellule<span style="color: #93E0E3;">(</span>celluleActuelle<span style="color: #93E0E3;">)</span>;
        insererSuivantCellule<span style="color: #93E0E3;">(</span>celluleActuelle,sommet<span style="color: #9FC59F;">(</span>l.pile<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>;
        depiler<span style="color: #93E0E3;">(</span>l.pile<span style="color: #93E0E3;">)</span>;
        suivantCellule<span style="color: #93E0E3;">(</span>celluleActuelle<span style="color: #93E0E3;">)</span>.val = val;
        insererSuivantCellule<span style="color: #93E0E3;">(</span>suivantCellule<span style="color: #9FC59F;">(</span>celluleActuelle<span style="color: #9FC59F;">)</span>,celluleSuivante<span style="color: #93E0E3;">)</span>;
      <span style="color: #D0BF8F;">}</span>
  <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> l;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="orgf21ac08"></a>supprimerElement O(i)<br />
<div class="outline-text-5" id="text-1-2-2-10">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #93E0E3;">supprimerElement</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span>,<span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">index</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span>index == 0<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      <span style="color: #F0DFAF; font-weight: bold;">return</span> supprimerTeteListe<span style="color: #D0BF8F;">(</span>l<span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">else</span> <span style="color: #BFEBBF;">{</span>
    <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">celluleActuelle</span> = teteListe<span style="color: #D0BF8F;">(</span>l<span style="color: #D0BF8F;">)</span>;
    <span style="color: #F0DFAF; font-weight: bold;">while</span><span style="color: #D0BF8F;">(</span>dernierCellule<span style="color: #93E0E3;">(</span>celluleActuelle<span style="color: #93E0E3;">)</span> != null &amp;&amp; i &gt; 1<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">{</span>
        i--;
        celluleActuelle = suivantCellule<span style="color: #93E0E3;">(</span>celluleActuelle<span style="color: #93E0E3;">)</span>;
      <span style="color: #D0BF8F;">}</span>
    <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #D0BF8F;">(</span>index == 1 &amp;&amp; <span style="color: #F0DFAF; font-weight: bold;">!</span>estPlein<span style="color: #93E0E3;">(</span>l.pile<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">{</span>
      <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">celluleASupprimer</span> = suivantCellule<span style="color: #93E0E3;">(</span>celluleActuelle<span style="color: #93E0E3;">)</span>;
      insererSuivantCellule<span style="color: #93E0E3;">(</span>celluleActuelle,suivantCellule<span style="color: #9FC59F;">(</span>celluleASupprimer<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>;
      empiler<span style="color: #93E0E3;">(</span>celluleASupprimer<span style="color: #93E0E3;">)</span>;
    <span style="color: #D0BF8F;">}</span>
    <span style="color: #F0DFAF; font-weight: bold;">return</span> l;
  <span style="color: #BFEBBF;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>



<div id="outline-container-org00d7b98" class="outline-3">
<h3 id="org00d7b98"><span class="section-number-3">1.3</span> QUESTION 2</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org83bef63" class="outline-4">
<h4 id="org83bef63"><span class="section-number-4">1.3.1</span> Implémentation</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
La liste sera implémentée de cette façon :
</p>
<ul class="org-ul">
<li>Une seule cellule qui représentera la tête de notre tableau.</li>
</ul>
</div>
</div>

<div id="outline-container-org52aef1c" class="outline-4">
<h4 id="org52aef1c"><span class="section-number-4">1.3.2</span> Les méthodes de la liste (même complexité en temps que la QUESTION 1)</h4>
<div class="outline-text-4" id="text-1-3-2">
</div>
<ol class="org-ol">
<li><a id="org9880266"></a>créerListe()<br />
<div class="outline-text-5" id="text-1-3-2-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #93E0E3;">creerListe</span><span style="color: #DCDCCC;">()</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span> = new Liste<span style="color: #BFEBBF;">()</span>;
  l.tete = null;
  <span style="color: #F0DFAF; font-weight: bold;">return</span> l;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>

<li><a id="org0a692ff"></a>estVideListe<br />
<div class="outline-text-5" id="text-1-3-2-2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">bool</span> <span style="color: #93E0E3;">estVideListe</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> teteListe<span style="color: #BFEBBF;">(</span>l<span style="color: #BFEBBF;">)</span> == null;
<span style="color: #DCDCCC;">}</span>  
</pre>
</div>
</div>
</li>
