TD_liste.org
**** insererTeteListe
     
     #+BEGIN_SRC c
       Liste insererTeteListe(Liste l,T val)
       {
         Cellule ancienneTete = teteListe(l);
         l.tete = creerCellule();
         l.tete.val = val;
         insererSuivantCellule(teteListe(l),ancienneTete);
         return l;
       }
     #+END_SRC
**** supprimerTeteListe

     #+BEGIN_SRC c 
       Liste supprimerTeteListe(Liste l)
       {
         Cellule nouvelleTete;
         if (teteListe(l) != null) {
           nouvelleTete = suivantCellule(teteListe(l));
         }
         else
           {
             nouvelleTete = null;
           }
         free(teteListe(l));
         l.tete = nouvelleTete; 
         return l;
       }
     #+END_SRC
**** tailleListe

     #+BEGIN_SRC c
       int tailleListe(Liste l)
       {
         int size = 0;
         Cellule celluleActuelle = teteListe(l);
         while (celluleActuelle != null)
           {
             size++;
           }

         return size;
       }  
     #+END_SRC

**** queue

     #+BEGIN_SRC c
              Liste queue(Liste l)
              {
                Liste retour = creerListe();
                retour.tete = suivantCellule(teteListe(l));
                return retour;
              }
     #+END_SRC
**** obtenirElement
     #+BEGIN_SRC c
       Cellule obtenirElement(Liste l,int i)
       {
         Cellule celluleActuelle = teteListe(l);
         while(celluleAtuelle != null && i > 0)
           {
             i--;
             celluleActuelle = suivantCellule(celluleActuelle);
           }
         return valeurCellule(celluleActuelle);

       }
     #+END_SRC
**** insererElement

     #+BEGIN_SRC c
       Liste insererElement(Liste l,T val,int index)
       {
         if(index == 0)
           {
             insererTeteListe(l,val);
           }
         else {
           Cellule celluleActuelle = teteListe(l);
           while (dernierCellule(celluleActuelle) && index > 1) {
             index--;
             celluleActuelle = suivantCellule(celluleActuelle);
           }
           Cellule celluleSuivante = suivantCellule(celluleActuelle);
           insererSuivantCellule(celluleActuelle,creerCellule());
           suivantCellule(celluleActuelle).val = val;
           insererSuivantCellule(suivantCellule(celluleActuelle),celluleSuivante)
         }
         return l;
       }
     #+END_SRC
**** supprimerElement

     #+BEGIN_SRC c
       Liste supprimerElement(Liste l,int index)
       {
         if(index == 0)
           {
             return supprimerTeteListe(l);
           }
         else {
           Cellule celluleActuelle = teteListe(l);
           while(dernierCellule(celluleActuelle) != null && i > 1)
             {
               i--;
               celluleActuelle = suivantCellule(celluleActuelle);
             }
           if (index == 1) {
             Cellule celluleASupprimer = suivantCellule(celluleActuelle);
             insererSuivantCellule(celluleActuelle,suivantCellule(celluleASupprimer));
             free(celluleASupprimer);
           }
           return l;
         }
       }
     #+END_SRC



