TD_liste.html

<li><a id="org1d128bf"></a>teteListe<br />
<div class="outline-text-5" id="text-1-3-2-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #93E0E3;">teteListe</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> l.tete;
<span style="color: #DCDCCC;">}</span>  
</pre>
</div>
</div>
</li>
<li><a id="org884d59e"></a>insererTeteListe<br />
<div class="outline-text-5" id="text-1-3-2-4">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #93E0E3;">insererTeteListe</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span>,<span style="color: #7CB8BB; font-weight: bold;">T</span> <span style="color: #DFAF8F;">val</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">ancienneTete</span> = teteListe<span style="color: #BFEBBF;">(</span>l<span style="color: #BFEBBF;">)</span>;
  l.tete = creerCellule<span style="color: #BFEBBF;">()</span>;
  l.tete.val = val;
  insererSuivantCellule<span style="color: #BFEBBF;">(</span>teteListe<span style="color: #D0BF8F;">(</span>l<span style="color: #D0BF8F;">)</span>,ancienneTete<span style="color: #BFEBBF;">)</span>;
  <span style="color: #F0DFAF; font-weight: bold;">return</span> l;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="org2dfb4f8"></a>supprimerTeteListe<br />
<div class="outline-text-5" id="text-1-3-2-5">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #93E0E3;">supprimerTeteListe</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">nouvelleTete</span>;
  <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #BFEBBF;">(</span>teteListe<span style="color: #D0BF8F;">(</span>l<span style="color: #D0BF8F;">)</span> != null<span style="color: #BFEBBF;">)</span> <span style="color: #BFEBBF;">{</span>
    nouvelleTete = suivantCellule<span style="color: #D0BF8F;">(</span>teteListe<span style="color: #93E0E3;">(</span>l<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>;
  <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">else</span>
    <span style="color: #BFEBBF;">{</span>
      nouvelleTete = null;
    <span style="color: #BFEBBF;">}</span>
  free<span style="color: #BFEBBF;">(</span>teteListe<span style="color: #D0BF8F;">(</span>l<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>;
  l.tete = nouvelleTete; 
  <span style="color: #F0DFAF; font-weight: bold;">return</span> l;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="org6d61f51"></a>tailleListe<br />
<div class="outline-text-5" id="text-1-3-2-6">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #93E0E3;">tailleListe</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">size</span> = 0;
  <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">celluleActuelle</span> = teteListe<span style="color: #BFEBBF;">(</span>l<span style="color: #BFEBBF;">)</span>;
  <span style="color: #F0DFAF; font-weight: bold;">while</span> <span style="color: #BFEBBF;">(</span>celluleActuelle != null<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      size++;
    <span style="color: #BFEBBF;">}</span>

  <span style="color: #F0DFAF; font-weight: bold;">return</span> size;
<span style="color: #DCDCCC;">}</span>  
</pre>
</div>
</div>
</li>

<li><a id="org0a6727e"></a>queue<br />
<div class="outline-text-5" id="text-1-3-2-7">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #93E0E3;">queue</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">retour</span> = creerListe<span style="color: #BFEBBF;">()</span>;
  retour.tete = suivantCellule<span style="color: #BFEBBF;">(</span>teteListe<span style="color: #D0BF8F;">(</span>l<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>;
  <span style="color: #F0DFAF; font-weight: bold;">return</span> retour;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="org0bfab73"></a>obtenirElement<br />
<div class="outline-text-5" id="text-1-3-2-8">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #93E0E3;">obtenirElement</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span>,<span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">i</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">celluleActuelle</span> = teteListe<span style="color: #BFEBBF;">(</span>l<span style="color: #BFEBBF;">)</span>;
  <span style="color: #F0DFAF; font-weight: bold;">while</span><span style="color: #BFEBBF;">(</span>celluleAtuelle != null &amp;&amp; i &gt; 0<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      i--;
      celluleActuelle = suivantCellule<span style="color: #D0BF8F;">(</span>celluleActuelle<span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> valeurCellule<span style="color: #BFEBBF;">(</span>celluleActuelle<span style="color: #BFEBBF;">)</span>;

<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="orgdc369b7"></a>insererElement<br />
<div class="outline-text-5" id="text-1-3-2-9">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #93E0E3;">insererElement</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span>,<span style="color: #7CB8BB; font-weight: bold;">T</span> <span style="color: #DFAF8F;">val</span>,<span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">index</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span>index == 0<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      insererTeteListe<span style="color: #D0BF8F;">(</span>l,val<span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">else</span> <span style="color: #BFEBBF;">{</span>
    <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">celluleActuelle</span> = teteListe<span style="color: #D0BF8F;">(</span>l<span style="color: #D0BF8F;">)</span>;
    <span style="color: #F0DFAF; font-weight: bold;">while</span> <span style="color: #D0BF8F;">(</span>dernierCellule<span style="color: #93E0E3;">(</span>celluleActuelle<span style="color: #93E0E3;">)</span> &amp;&amp; index &gt; 1<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">{</span>
      index--;
      celluleActuelle = suivantCellule<span style="color: #93E0E3;">(</span>celluleActuelle<span style="color: #93E0E3;">)</span>;
    <span style="color: #D0BF8F;">}</span>
    <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">celluleSuivante</span> = suivantCellule<span style="color: #D0BF8F;">(</span>celluleActuelle<span style="color: #D0BF8F;">)</span>;
    insererSuivantCellule<span style="color: #D0BF8F;">(</span>celluleActuelle,creerCellule<span style="color: #93E0E3;">()</span><span style="color: #D0BF8F;">)</span>;
    suivantCellule<span style="color: #D0BF8F;">(</span>celluleActuelle<span style="color: #D0BF8F;">)</span>.val = val;
    insererSuivantCellule<span style="color: #D0BF8F;">(</span>suivantCellule<span style="color: #93E0E3;">(</span>celluleActuelle<span style="color: #93E0E3;">)</span>,celluleSuivante<span style="color: #D0BF8F;">)</span>
  <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> l;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="org86a76d8"></a>supprimerElement<br />
<div class="outline-text-5" id="text-1-3-2-10">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #93E0E3;">supprimerElement</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span>,<span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">index</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span>index == 0<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      <span style="color: #F0DFAF; font-weight: bold;">return</span> supprimerTeteListe<span style="color: #D0BF8F;">(</span>l<span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">else</span> <span style="color: #BFEBBF;">{</span>
    <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">celluleActuelle</span> = teteListe<span style="color: #D0BF8F;">(</span>l<span style="color: #D0BF8F;">)</span>;
    <span style="color: #F0DFAF; font-weight: bold;">while</span><span style="color: #D0BF8F;">(</span>dernierCellule<span style="color: #93E0E3;">(</span>celluleActuelle<span style="color: #93E0E3;">)</span> != null &amp;&amp; i &gt; 1<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">{</span>
        i--;
        celluleActuelle = suivantCellule<span style="color: #93E0E3;">(</span>celluleActuelle<span style="color: #93E0E3;">)</span>;
      <span style="color: #D0BF8F;">}</span>
    <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #D0BF8F;">(</span>index == 1<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">{</span>
      <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">celluleASupprimer</span> = suivantCellule<span style="color: #93E0E3;">(</span>celluleActuelle<span style="color: #93E0E3;">)</span>;
      insererSuivantCellule<span style="color: #93E0E3;">(</span>celluleActuelle,suivantCellule<span style="color: #9FC59F;">(</span>celluleASupprimer<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>;
      free<span style="color: #93E0E3;">(</span>celluleASupprimer<span style="color: #93E0E3;">)</span>;
    <span style="color: #D0BF8F;">}</span>
    <span style="color: #F0DFAF; font-weight: bold;">return</span> l;
  <span style="color: #BFEBBF;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
