TD_liste.org
** QUESTION 3 

Pour avoir une liste chainée bi-directionelle, il faudrait rajouter dans la cellule une variable prec pour stocker la position de la cellule précédente (de la même façon que pour la variable suiv)
ainsi que des méthodes precedenteCellule() et insertionPrecedenteCellule() qui vont modifier de la même façon que suiv la variable prec.
  
De plus partout ou on a modifié notre variable suiv, il faudrait modifier la variable prec de la cellule qui suit (sauf si le suivant est null) (ex insertionSuivantCellule(c1,c2) -> insertionPrecedentCellule(c2,c1)).

Pour la liste chainée circulaire (pas bi-directionelle) il faudra remplacer tous nos null par la valeur de la tete de liste (par exemple lorsqu'on on regardait si notre cellule et la dernière, il faudra faire suivantCellule(celluleActuelle) == teteListe(l)). Il faudra aussi bien penser lors de l'ajout d'un element qui se retrouve être le dernier ou le premier de la liste qu'on doit avoir la variable suiv du dernier bien modifié, de même lorqu'on supprime la tête (ce qui va consister à modifier inserer/supprimerTeteListe et rajouter une condition lorsque on ajoute/supprime le dernier element si on a défini les méthodes obtenir/supprimerElement comme dans la question 2 ainsi que la méthode queue) .  

* Exo 2

cette algorithme va renverser une liste.

* Exo 3
  Tout en O(1);
** QUESTION 1 

Le seul moyen pour avoir une concaténation de deux liste en temps O(1) et d'avoir des listes circulaires. En effet on va faire : 
(on suppose que insererPrecedentCellule ~= insererSuivantCellule 
 et precedentCellule ~= suivantCellule.
 la seule différence étant qu'il modifie la valeur qui représente la cellule précédente). 

#+BEGIN_SRC c 
        void concatenation(Liste l1,Liste l2)
      {
        insererSuivantCellule(precedentCellule(teteListe(l1)),teteListe(l2));
        insererSuivantCellule(precedentCellule(teteListe(l2)),teteListe(l1));

        Cellule ancienDernierL1 = precedentCellule(teteListe(l1));

        insererPrecedentCellule(teteListe(l1),precedentCellule(teteListe(l2)));
        insererPrecedentCellule(teteListe(l2),ancienDernierL1);
      } 
#+END_SRC

** QUESTION 2
** QUESTION 3

*** PILE (est donc composée d'une liste l);

**** creerPile

#+BEGIN_SRC c
    Pile creerPile()
  {
    Pile p = new Pile();
    p.l = creerListe();
    return p;
  }
#+END_SRC

**** estVide

#+BEGIN_SRC c
  bool estVide(Pile p)
  {
    return estVideListe(p.l);
  }

#+END_SRC

**** empiler

#+BEGIN_SRC c
  Pile empiler(Pile p,T val)
  {
    insererTeteListe(p.l,val);
    return p;
  }
#+END_SRC

**** depiler

#+BEGIN_SRC c
  Pile depiler(Pile p)
  {
    supprimerTeteListe(p.l);
    return p;
  }
#+END_SRC

**** sommet

#+BEGIN_SRC c
  T sommet(Pile p)
  {
    return valeurCellule(teteListe(p.l));
  }
#+END_SRC

*** FILE (est donc composée d'une liste l);

**** creerFile

#+BEGIN_SRC c
    Pile creerFile()
  {
    File f = new File();
    f.l = creerListe();
    return f;
  }
#+END_SRC

**** estVide

#+BEGIN_SRC c
  bool estVide(File f)
  {
    return estVideListe(f.l);
  }

#+END_SRC

**** emfiler

#+BEGIN_SRC c
  File empiler(File f,T val)
  {
    insererTeteListe(f.l,val);
    return f;
  }
#+END_SRC

