TD_liste.html



<div id="outline-container-org10907cb" class="outline-3">
<h3 id="org10907cb"><span class="section-number-3">1.4</span> QUESTION 3</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Pour avoir une liste chainée bi-directionelle, il faudrait rajouter dans la cellule une variable prec pour stocker la position de la cellule précédente (de la même façon que pour la variable suiv)
ainsi que des méthodes precedenteCellule() et insertionPrecedenteCellule() qui vont modifier de la même façon que suiv la variable prec.
</p>

<p>
De plus partout ou on a modifié notre variable suiv, il faudrait modifier la variable prec de la cellule qui suit (sauf si le suivant est null) (ex insertionSuivantCellule(c1,c2) -&gt; insertionPrecedentCellule(c2,c1)).
</p>

<p>
Pour la liste chainée circulaire (pas bi-directionelle) il faudra remplacer tous nos null par la valeur de la tete de liste (par exemple lorsqu'on on regardait si notre cellule et la dernière, il faudra faire suivantCellule(celluleActuelle) == teteListe(l)). Il faudra aussi bien penser lors de l'ajout d'un element qui se retrouve être le dernier ou le premier de la liste qu'on doit avoir la variable suiv du dernier bien modifié, de même lorqu'on supprime la tête (ce qui va consister à modifier inserer/supprimerTeteListe et rajouter une condition lorsque on ajoute/supprime le dernier element si on a défini les méthodes obtenir/supprimerElement comme dans la question 2 ainsi que la méthode queue) .  
</p>
</div>
</div>
</div>

<div id="outline-container-org9f3dc25" class="outline-2">
<h2 id="org9f3dc25"><span class="section-number-2">2</span> Exo 2</h2>
<div class="outline-text-2" id="text-2">
<p>
cette algorithme va renverser une liste.
</p>
</div>
</div>

<div id="outline-container-org4b94ffc" class="outline-2">
<h2 id="org4b94ffc"><span class="section-number-2">3</span> Exo 3</h2>
<div class="outline-text-2" id="text-3">
<p>
Tout en O(1);
</p>
</div>
<div id="outline-container-org2c2dfe1" class="outline-3">
<h3 id="org2c2dfe1"><span class="section-number-3">3.1</span> QUESTION 1</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Le seul moyen pour avoir une concaténation de deux liste en temps O(1) et d'avoir des listes circulaires. En effet on va faire : 
(on suppose que insererPrecedentCellule ~= insererSuivantCellule 
 et precedentCellule ~= suivantCellule.
 la seule différence étant qu'il modifie la valeur qui représente la cellule précédente). 
</p>

<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7CB8BB; font-weight: bold;">void</span> <span style="color: #93E0E3;">concatenation</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l1</span>,<span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l2</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  insererSuivantCellule<span style="color: #BFEBBF;">(</span>precedentCellule<span style="color: #D0BF8F;">(</span>teteListe<span style="color: #93E0E3;">(</span>l1<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>,teteListe<span style="color: #D0BF8F;">(</span>l2<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>;
  insererSuivantCellule<span style="color: #BFEBBF;">(</span>precedentCellule<span style="color: #D0BF8F;">(</span>teteListe<span style="color: #93E0E3;">(</span>l2<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>,teteListe<span style="color: #D0BF8F;">(</span>l1<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>;

  <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">ancienDernierL1</span> = precedentCellule<span style="color: #BFEBBF;">(</span>teteListe<span style="color: #D0BF8F;">(</span>l1<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>;

  insererPrecedentCellule<span style="color: #BFEBBF;">(</span>teteListe<span style="color: #D0BF8F;">(</span>l1<span style="color: #D0BF8F;">)</span>,precedentCellule<span style="color: #D0BF8F;">(</span>teteListe<span style="color: #93E0E3;">(</span>l2<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>;
  insererPrecedentCellule<span style="color: #BFEBBF;">(</span>teteListe<span style="color: #D0BF8F;">(</span>l2<span style="color: #D0BF8F;">)</span>,ancienDernierL1<span style="color: #BFEBBF;">)</span>;
<span style="color: #DCDCCC;">}</span> 
</pre>
</div>
</div>
</div>

<div id="outline-container-org1895cfa" class="outline-3">
<h3 id="org1895cfa"><span class="section-number-3">3.2</span> QUESTION 2</h3>
</div>
<div id="outline-container-orga8880fe" class="outline-3">
<h3 id="orga8880fe"><span class="section-number-3">3.3</span> QUESTION 3</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org6ebc9ad" class="outline-4">
<h4 id="org6ebc9ad"><span class="section-number-4">3.3.1</span> PILE (est donc composée d'une liste l);</h4>
<div class="outline-text-4" id="text-3-3-1">
</div>
<ol class="org-ol">
<li><a id="orgff9be6a"></a>creerPile<br />
<div class="outline-text-5" id="text-3-3-1-1">
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7CB8BB; font-weight: bold;">Pile</span> <span style="color: #93E0E3;">creerPile</span><span style="color: #DCDCCC;">()</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Pile</span> <span style="color: #DFAF8F;">p</span> = new Pile<span style="color: #BFEBBF;">()</span>;
  p.l = creerListe<span style="color: #BFEBBF;">()</span>;
  <span style="color: #F0DFAF; font-weight: bold;">return</span> p;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>

<li><a id="org3c6150c"></a>estVide<br />
<div class="outline-text-5" id="text-3-3-1-2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">bool</span> <span style="color: #93E0E3;">estVide</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Pile</span> <span style="color: #DFAF8F;">p</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> estVideListe<span style="color: #BFEBBF;">(</span>p.l<span style="color: #BFEBBF;">)</span>;
<span style="color: #DCDCCC;">}</span>

</pre>
</div>
</div>
</li>

<li><a id="org7fe379e"></a>empiler<br />
<div class="outline-text-5" id="text-3-3-1-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Pile</span> <span style="color: #93E0E3;">empiler</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Pile</span> <span style="color: #DFAF8F;">p</span>,<span style="color: #7CB8BB; font-weight: bold;">T</span> <span style="color: #DFAF8F;">val</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  insererTeteListe<span style="color: #BFEBBF;">(</span>p.l,val<span style="color: #BFEBBF;">)</span>;
  <span style="color: #F0DFAF; font-weight: bold;">return</span> p;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>

<li><a id="org5180020"></a>depiler<br />
<div class="outline-text-5" id="text-3-3-1-4">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">Pile</span> <span style="color: #93E0E3;">depiler</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Pile</span> <span style="color: #DFAF8F;">p</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  supprimerTeteListe<span style="color: #BFEBBF;">(</span>p.l<span style="color: #BFEBBF;">)</span>;
  <span style="color: #F0DFAF; font-weight: bold;">return</span> p;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>

<li><a id="orgb1b752b"></a>sommet<br />
<div class="outline-text-5" id="text-3-3-1-5">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">T</span> <span style="color: #93E0E3;">sommet</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Pile</span> <span style="color: #DFAF8F;">p</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> valeurCellule<span style="color: #BFEBBF;">(</span>teteListe<span style="color: #D0BF8F;">(</span>p.l<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org83cde9b" class="outline-4">
<h4 id="org83cde9b"><span class="section-number-4">3.3.2</span> FILE (est donc composée d'une liste l);</h4>
<div class="outline-text-4" id="text-3-3-2">
</div>
<ol class="org-ol">
<li><a id="org2bac814"></a>creerFile<br />
<div class="outline-text-5" id="text-3-3-2-1">
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7CB8BB; font-weight: bold;">Pile</span> <span style="color: #93E0E3;">creerFile</span><span style="color: #DCDCCC;">()</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">File</span> <span style="color: #DFAF8F;">f</span> = new File<span style="color: #BFEBBF;">()</span>;
  f.l = creerListe<span style="color: #BFEBBF;">()</span>;
  <span style="color: #F0DFAF; font-weight: bold;">return</span> f;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>

<li><a id="orgbf2f8f1"></a>estVide<br />
<div class="outline-text-5" id="text-3-3-2-2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">bool</span> <span style="color: #93E0E3;">estVide</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">File</span> <span style="color: #DFAF8F;">f</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> estVideListe<span style="color: #BFEBBF;">(</span>f.l<span style="color: #BFEBBF;">)</span>;
<span style="color: #DCDCCC;">}</span>

</pre>
</div>
</div>
</li>

<li><a id="org1237ff1"></a>emfiler<br />
<div class="outline-text-5" id="text-3-3-2-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB; font-weight: bold;">File</span> <span style="color: #93E0E3;">empiler</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">File</span> <span style="color: #DFAF8F;">f</span>,<span style="color: #7CB8BB; font-weight: bold;">T</span> <span style="color: #DFAF8F;">val</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  insererTeteListe<span style="color: #BFEBBF;">(</span>f.l,val<span style="color: #BFEBBF;">)</span>;
  <span style="color: #F0DFAF; font-weight: bold;">return</span> f;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</li>
